## Plan Result (stg_backendappgateway)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[1]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw"
    }

  # module.backendappgateway.azurerm_application_gateway.ag[1] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw"
        name                              = "cft-aks01-aat-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (7 unchanged attributes hidden)

      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "idam-user-profile-bridge"
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/ccpay-cpo-update-service" -> null
          - name                                = "ccpay-cpo-update-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/ccpay-cpo-update-service" -> null
          - probe_name                          = "ccpay-cpo-update-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/civil-general-applications" -> null
          - name                                = "civil-general-applications" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/civil-general-applications" -> null
          - probe_name                          = "civil-general-applications" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/civil-orchestrator-service" -> null
          - name                                = "civil-orchestrator-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/civil-orchestrator-service" -> null
          - probe_name                          = "civil-orchestrator-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/cpo-case-payment-orders-api" -> null
          - name                                = "cpo-case-payment-orders-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/cpo-case-payment-orders-api" -> null
          - probe_name                          = "cpo-case-payment-orders-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/et-cos" -> null
          - name                                = "et-cos" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/et-cos" -> null
          - probe_name                          = "et-cos" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/et-hearings-api" -> null
          - name                                = "et-hearings-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/et-hearings-api" -> null
          - probe_name                          = "et-hearings-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/et-msg-handler" -> null
          - name                                = "et-msg-handler" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/et-msg-handler" -> null
          - probe_name                          = "et-msg-handler" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/et-sya-api" -> null
          - name                                = "et-sya-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/et-sya-api" -> null
          - probe_name                          = "et-sya-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/fis-bulk-scan-api" -> null
          - name                                = "fis-bulk-scan-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/fis-bulk-scan-api" -> null
          - probe_name                          = "fis-bulk-scan-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/fis-cos-api" -> null
          - name                                = "fis-cos-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/fis-cos-api" -> null
          - probe_name                          = "fis-cos-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/fis-hmc-api" -> null
          - name                                = "fis-hmc-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/fis-hmc-api" -> null
          - probe_name                          = "fis-hmc-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/fprl-cos" -> null
          - name                                = "fprl-cos" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/fprl-cos" -> null
          - probe_name                          = "fprl-cos" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/fprl-dgs" -> null
          - name                                = "fprl-dgs" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/fprl-dgs" -> null
          - probe_name                          = "fprl-dgs" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/hmc-cft-hearing-service" -> null
          - name                                = "hmc-cft-hearing-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/hmc-cft-hearing-service" -> null
          - probe_name                          = "hmc-cft-hearing-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/hmc-hmi-inbound-adapter" -> null
          - name                                = "hmc-hmi-inbound-adapter" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/hmc-hmi-inbound-adapter" -> null
          - probe_name                          = "hmc-hmi-inbound-adapter" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/hmc-hmi-outbound-adapter" -> null
          - name                                = "hmc-hmi-outbound-adapter" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/hmc-hmi-outbound-adapter" -> null
          - probe_name                          = "hmc-hmi-outbound-adapter" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/ia-bail-case-api" -> null
          - name                                = "ia-bail-case-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/probes/ia-bail-case-api" -> null
          - probe_name                          = "ia-bail-case-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

t-aks01-aat-agw/requestRoutingRules/idam-user-dashboard"
          + name                       = "idam-user-dashboard"
          + priority                   = 150
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/prl-cos"
          + backend_address_pool_name  = "prl-cos"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/prl-cos"
          + backend_http_settings_name = "prl-cos"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/httpListeners/prl-cos"
          + http_listener_name         = "prl-cos"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/requestRoutingRules/prl-cos"
          + name                       = "prl-cos"
          + priority                   = 90
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/prl-dgs"
          + backend_address_pool_name  = "prl-dgs"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/prl-dgs"
          + backend_http_settings_name = "prl-dgs"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/httpListeners/prl-dgs"
          + http_listener_name         = "prl-dgs"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/requestRoutingRules/prl-dgs"
          + name                       = "prl-dgs"
          + priority                   = 100
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/wa-case-event-handler"
          + backend_address_pool_name  = "wa-case-event-handler"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/wa-case-event-handler"
          + backend_http_settings_name = "wa-case-event-handler"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/httpListeners/wa-case-event-handler"
          + http_listener_name         = "wa-case-event-handler"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/requestRoutingRules/wa-case-event-handler"
          + name                       = "wa-case-event-handler"
          + priority                   = 10
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendAddressPools/wa-task-monitor"
          + backend_address_pool_name  = "wa-task-monitor"
          + backend_http_settings_id   = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/backendHttpSettingsCollection/wa-task-monitor"
          + backend_http_settings_name = "wa-task-monitor"
          + http_listener_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/httpListeners/wa-task-monitor"
          + http_listener_name         = "wa-task-monitor"
          + id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw/requestRoutingRules/wa-task-monitor"
          + name                       = "wa-task-monitor"
          + priority                   = 20
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ccpay-cpo-update-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ccpay-cpo-update-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ccpay-cpo-update-service"
          + id                         = (known after apply)
          + name                       = "ccpay-cpo-update-service"
          + priority                   = 320
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "civil-general-applications"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "civil-general-applications"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "civil-general-applications"
          + id                         = (known after apply)
          + name                       = "civil-general-applications"
          + priority                   = 290
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "civil-orchestrator-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "civil-orchestrator-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "civil-orchestrator-service"
          + id                         = (known after apply)
          + name                       = "civil-orchestrator-service"
          + priority                   = 300
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "fis-bulk-scan-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "fis-bulk-scan-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "fis-bulk-scan-api"
          + id                         = (known after apply)
          + name                       = "fis-bulk-scan-api"
          + priority                   = 210
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "fis-cos-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "fis-cos-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "fis-cos-api"
          + id                         = (known after apply)
          + name                       = "fis-cos-api"
          + priority                   = 200
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "fis-hmc-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "fis-hmc-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "fis-hmc-api"
          + id                         = (known after apply)
          + name                       = "fis-hmc-api"
          + priority                   = 220
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "hmc-cft-hearing-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "hmc-cft-hearing-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "hmc-cft-hearing-service"
          + id                         = (known after apply)
          + name                       = "hmc-cft-hearing-service"
          + priority                   = 230
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "hmc-hmi-inbound-adapter"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "hmc-hmi-inbound-adapter"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "hmc-hmi-inbound-adapter"
          + id                         = (known after apply)
          + name                       = "hmc-hmi-inbound-adapter"
          + priority                   = 240
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "hmc-hmi-outbound-adapter"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "hmc-hmi-outbound-adapter"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "hmc-hmi-outbound-adapter"
          + id                         = (known after apply)
          + name                       = "hmc-hmi-outbound-adapter"
          + priority                   = 250
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-user-profile-bridge"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-user-profile-bridge"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-user-profile-bridge"
          + id                         = (known after apply)
          + name                       = "idam-user-profile-bridge"
          + priority                   = 180
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "jps-judicial-payment-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "jps-judicial-payment-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "jps-judicial-payment-service"
          + id                         = (known after apply)
          + name                       = "jps-judicial-payment-service"
          + priority                   = 330
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "plum-recipe-backend"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "plum-recipe-backend"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "plum-recipe-backend"
          + id                         = (known after apply)
          + name                       = "plum-recipe-backend"
          + priority                   = 270
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rpts-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rpts-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rpts-api"
          + id                         = (known after apply)
          + name                       = "rpts-api"
          + priority                   = 190
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sptribs-case-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sptribs-case-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sptribs-case-api"
          + id                         = (known after apply)
          + name                       = "sptribs-case-api"
          + priority                   = 310
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-hearings-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-hearings-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-hearings-api"
          + id                         = (known after apply)
          + name                       = "sscs-hearings-api"
          + priority                   = 280
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "ts-translation-service"
          + id                         = (known after apply)
          + name                       = "ts-translation-service"
          + priority                   = 260
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (42 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks00-aat-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-aat-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1689,"Program":"tfcmt","SHA1":"","Target":"stg_backendappgateway","Vars":{}} -->